system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs_NEMO4_Boom
{
	patches         (NEMO4_Boom);
    
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    50;

    log             yes;

    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 1 0);
    magUInf         28;
    lRef            1;        
    Aref            0.6394;        
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
}

forceCoeffs_NEMO4_Engine
{
	patches         (NEMO4_Engine);
    
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    50;

    log             yes;

    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 1 0);
    magUInf         28;
    lRef            1;        
    Aref            0.6394;        
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
}

forceCoeffs_NEMO4_FrontLG
{
	patches         (NEMO4_FrontLG);
    
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    50;

    log             yes;

    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 1 0);
    magUInf         28;
    lRef            1;        
    Aref            0.6394;        
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
}

forceCoeffs_NEMO4_FrontQuadProp
{
	patches         (NEMO4_FrontQuadProp);
    
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    50;

    log             yes;

    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 1 0);
    magUInf         28;
    lRef            1;        
    Aref            0.6394;        
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
}

forceCoeffs_NEMO4_Fuselage
{
	patches         (NEMO4_Fuselage);
    
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    50;

    log             yes;

    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 1 0);
    magUInf         28;
    lRef            1;        
    Aref            0.6394;        
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
}

forceCoeffs_NEMO4_RearLG
{
	patches         (NEMO4_RearLG);
    
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    50;

    log             yes;

    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 1 0);
    magUInf         28;
    lRef            1;        
    Aref            0.6394;        
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
}

forceCoeffs_NEMO4_RearQuadProp
{
	patches         (NEMO4_RearQuadProp);
    
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    50;

    log             yes;

    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 1 0);
    magUInf         28;
    lRef            1;        
    Aref            0.6394;        
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
}

forceCoeffs_NEMO4_Wing
{
	patches         (NEMO4_Wing);
    
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    50;

    log             yes;

    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 1 0);
    magUInf         28;
    lRef            1;        
    Aref            0.6394;        
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
}


